import vk_api, time,colorama
from colorama import Fore, Back, Style
from vk_api import VkUpload
colorama.init()

priva = [
"""
██████╗░██╗░░██╗░█████╗░████████╗░█████╗░███╗░░██╗░█████╗░██╗░░██╗██████╗░██╗░░░██╗████████╗██╗░░██╗░█████╗░
██╔══██╗██║░░██║██╔══██╗╚══██╔══╝██╔══██╗████╗░██║██╔══██╗██║░██╔╝██╔══██╗██║░░░██║╚══██╔══╝██║░██╔╝██╔══██╗
██████╔╝███████║██║░░██║░░░██║░░░██║░░██║██╔██╗██║███████║█████═╝░██████╔╝██║░░░██║░░░██║░░░█████═╝░███████║
██╔═══╝░██╔══██║██║░░██║░░░██║░░░██║░░██║██║╚████║██╔══██║██╔═██╗░██╔══██╗██║░░░██║░░░██║░░░██╔═██╗░██╔══██║
██║░░░░░██║░░██║╚█████╔╝░░░██║░░░╚█████╔╝██║░╚███║██║░░██║██║░╚██╗██║░░██║╚██████╔╝░░░██║░░░██║░╚██╗██║░░██║
╚═╝░░░░░╚═╝░░╚═╝░╚════╝░░░░╚═╝░░░░╚════╝░╚═╝░░╚══╝╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚═╝░╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚═╝
"""
]

opicanya = [
"""
Накрутка фотографий в ВК\nЧто бы продолжить пишите 1.
"""
]
print(Fore.GREEN + priva[0])
print(Fore.RED + opicanya[0])
vibor = input('-->')
if vibor == "1":
	login1 = input('+79531072826:')
	password1 = input('w212r63:')
	album = input('286423429:')
vk_session = vk_api.VkApi(login=login1, password=password1, app_id='2685278')
vk_session.auth(token_only=True)
vks = vk_session
upload = VkUpload(vk_session)

while True: 
	upload.photo(photos="photo.jpg",album_id=album)
